import xl

import epubpacker

title1 = "序"

title2 = "元亨寺住持釋菩妙領眾敬序"

lines = (
    "洎乎泰西學者致力於南傳巴利聖典之研究，紹承根本佛教思想、啟攝部派佛教義蘊之原始佛教，遂比峻於嵩華而爭長於江漢，大乘之研幾探微者，"
    "顧此小乘經律論終究未能恝置。試循此一近於佛世之聖典，探察釋尊創教時之特有深見，審度其思想所自來。圖原始佛教之鴻法，究巴利三藏之驪珠。",

    "然而南傳巴利聖典，因語文問題，識者蓋寡。今欲敷讚聖典，啟耀大寶，莫若迻譯。爰就《漢譯南傳大藏經》之價值，"
    "略事論列，凡有兩端：佛學研究與宗教信仰。",

    "佛學研究，其一是文獻學之價值。當代佛學研究，理融歐亞，論衡之士，一則取法歐美南傳巴利三藏之沈一揅，一則宏觀禹域北傳梵文三藏之深曠，"
    "舖列比勘，相互苴綴，補足闕遺，斷決三藏之某些疑義，並顯明其事項。其二則是宗教學之價值。宗教研究之方法學乃一社會科學，"
    "依方法學之不同觀點與範疇，究明宗教之本質、結構與現象。南傳巴利聖典之集成，存有彼時印度之民間信仰、風俗習慣、學說思潮、"
    "政經形態及種族問題等，吾人可採宗教現象學、宗教社會學、宗教詮釋學、宗教心理學、宗教人類學之方法進路，析原始佛法之真相而著其指歸。",

    "宗教信仰，其一是近於佛世信仰之價值。南傳巴利聖典，去佛未遠，於佛法之解說較為明智且合理。諸及門弟子所說，"
    "凡歷三時：受持、傳誦、結集，見佛所見，證佛所證，故能與佛之教說同受尊重。然而在佛教之長期發展史中，流變所及，遂失其真。"
    "今依巴利三藏以探尋原始佛法，適可體證釋尊之本懷，回歸佛陀之時代。其二則是分享信仰經驗之價值，乃啟中國大乘佛教與海南佛教會通之門。"
    "傳統佛教界，頗重梵響，特標大乘多勝利他、空性真如之義，遂使聖典寢聲，莫或抽緒。"
    "若能循會通而鑑照，得其環中，則沿根討葉，必能綜覽義林，總持法苑，如量修證，咸歸正覺。",

    "《漢譯南傳大藏經》之價值，持此兩端，揭為四長，治佛學者，必資之以為津梁；言信仰者，捨此又安窺潭奥？"
    "迻譯鏤槧，正足以發真諦於三藏，燦佛光於聖典，上叩釋尊之遺聞，下抉教法之奥論！"
)

luokuan = "民國七十九年元月序於高雄"


def write_xu(ebook: epubpacker.Epub, xc):
    import epub_public
    html, body = epub_public.make_doc("xu.xhtml", xc, "序")
    body.attrs["class"] = "xu"
    body.ekid("h3", kids=[xc.c(title1)])
    body.ekid("h3", kids=[xc.c(title2)])
    for line in lines:
        body.ekid("p", kids=[xc.c(line)])
    body.ekid("p", {"class": "luokuan"}, [xc.c(luokuan)])

    htmlstr = xl.Xml(root=html).to_str(do_pretty=True, dont_do_tags=["title", "p", "h1", "h2", "h3", "h4"])
    doc_path = "xu.xhtml"
    ebook.marks.append(epubpacker.Mark("序", doc_path))
    ebook.userfiles[doc_path] = htmlstr
    ebook.spine.append(doc_path)

